In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(np.random.randn(10),
              index=[["a", "a", "a", "b", "b", "b", "c", "c", "d", "d"],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [3]:
s

a  1    1.021796
   2    1.135035
   3   -1.635546
b  1   -0.466020
   2   -0.455275
   3    0.233697
c  1    0.032246
   2   -1.117636
d  2   -0.419424
   3   -0.467962
dtype: float64

In [4]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [5]:
s["b"]

1   -0.466020
2   -0.455275
3    0.233697
dtype: float64

In [7]:
s["b":"c"]

b  1   -0.466020
   2   -0.455275
   3    0.233697
c  1    0.032246
   2   -1.117636
dtype: float64

In [8]:
s[("b",3)]

0.2336969208785425

In [10]:
s[:,2]

a    1.135035
b   -0.455275
c   -1.117636
d   -0.419424
dtype: float64

In [13]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)),
                               index=[["a", "a", "b", "b"], 
                                      [1, 2, 1, 2]],
                               columns=[["Seoul", "Seoul", "Busan"],
                                        ["Green", "Red", "Green"]])

In [14]:
df

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [18]:
df.index.names=["key1","key2"]

In [19]:
df.columns.names = ["city","color"]

In [20]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [21]:
df["Seoul"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [22]:
df[("Seoul","Green")]

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int32

In [23]:
df.loc["a",1]

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int32

In [24]:
df.loc["b",("Seoul","Red")]

key2
1     7
2    10
Name: (Seoul, Red), dtype: int32

In [25]:
df.sort_index(axis=0, level=0)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [26]:
df.sort_index(axis=0, level=1)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [27]:
df.sort_index(axis=1, level=0)

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [28]:
df.sort_index(axis=1,level=1)

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [29]:
df.sort_values(by=("Busan","Green"))

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [30]:
df.sum(axis=0,level=0)

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [32]:
df.sum(axis=0,level=1)

city  Seoul     Busan
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [33]:
df.mean(axis=1,level="color")

color      Green  Red
key1 key2
a    1         1    1
     2         4    4
b    1         7    7
     2        10   10

In [34]:
df2 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                    'd': [0, 1, 2, 0, 1, 2, 3]})

In [35]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [36]:
df2.set_index(["c","d"])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [37]:
df2.set_index(["c","d"],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [39]:
df2.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

In [40]:
df4 = pd.DataFrame(np.arange(6).reshape((2, 3)),
                   index=['Seoul', 'Busan'], 
                   columns=['one', 'two', 'three'])
df4.index.name = "city"
df4.columns.name = "number"

In [41]:
df5 = df4.stack()

In [43]:
df4

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [42]:
df5

city   number
Seoul  one       0
       two       1
       three     2
Busan  one       3
       two       4
       three     5
dtype: int32

In [45]:
df6 = pd.DataFrame({"left": df5, "right": df5 + 5},
                   columns=["left", "right"])
df6.columns.name = "side"

In [46]:
df6

side          left  right
city  number
Seoul one        0      5
      two        1      6
      three      2      7
Busan one        3      8
      two        4      9
      three      5     10

In [47]:
df6.unstack()

side   left           right
number  one two three   one two three
city
Seoul     0   1     2     5   6     7
Busan     3   4     5     8   9    10

In [48]:
df6.unstack(level="city")

side    left       right
city   Seoul Busan Seoul Busan
number
one        0     3     5     8
two        1     4     6     9
three      2     5     7    10